{
  "main": {
    "name":"Melvin Alex Mathew Andoor",
    "occupation":"Graduate Student at University of Massachusetts Dartmouth",
    "description":" looking for Full time oppportunities starting this July 2021 ",
    "image":"profilepic.jpg",
    "bio":"I am a professional programmer with profound knowledge in python, java and software development gained from my master’s and bachelor’s studies as a computer science student. I was Front End Developer Intern at Don Bosco Institute of technology during my bachelor’s studies. From my expertise seen in these programming languages and the number of experiences gained through my internship and the various projects done I find myself learning, often to the degree of obsession. The better I get the more I realize that I do not know much, and I am always on the path of catching up. I believe just like an AI one should be constantly learning and apply those technically to gain practical experience.",
    "contactmessage":"Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "mandoor1997@gmail.com",
    "phone": "(774) 365-7755",
    "address":{
      "city":"Boston",
      "state":"Massachusetts"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload":"MelvinAndoor_Resume.pdf",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/melvin.mathew.5872",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"http://linkedin.com/in/melvin-andoor/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"github",
        "url":"https://github.com/MelvinAlex28",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"I'm a philomath and am always interested in playing around with new technologies but these are the ones that have really won me over.",
    "education":[
      {
        "school":"University of Massachusetts Dartmouth",
        "degree":"Master's in Computer Science",
        "graduated":"Graduating May 2021",
        "description":"GPA: 3.6\nRelevent Courseworks: Algorithms and Complexities, Paradigmatic Software Development, Database Design, Data Visualizations, Data Analytics."
      },
      {
        "school":"Don Bosco Institute of Technology, Mumbai University",
        "degree":"Bachelor's in Computer Engineering",
        "graduated":"Class of 2019",
        "description":"GPA: 3.2\nRelevant Courseworks: Software Engineering, Algorithms, Data Structures, Database Systems, Structure and Object Oriented Analysis and Design."
      }
    ],
    "work":[
      {
        "company":"Don Bosco Institute of Technology",
        "title": "Frontend Developer Intern",
        "years": "July 2017 - October 2017",
        "description": "Developed and implemented along with a team of UI/UX designers a visually appealing Front End of the Don Bosco Journal of Science and Engineering using Bootstrap, HTML, CSS and JavaScript.\nAssessed UI and UX designs for technical feasibility."
      }
    ],
    "skills":[
      {
        "name":"Git",
        "description":"I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image":"git.jpg"
      },
      {
        "name":"Java",
        "description":"Java was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image":"java.jpg"
      },
      {
        "name":"Python",
        "description":"Python is my most prefered programming language and I can say that I am proficient enough to code any given problem in python",
        "image":"python.png"
      },
      {
        "name":"React Js",
        "description":"I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website template (link below in portfolio) which I used as a starting point for this personal site.",
        "image":"react.jpg"
      },
      {
        "name":"Node JS",
        "description":"Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with MeteorJS-based projects",
        "image":"node.jpg"
      },
      {
        "name":"Bootstrap 4",
        "description":"I use Bootstrap more often than not when designing the layout for my sites. It is the framework I am most familiar with and can therefore design more quickly than with others.",
        "image":"bootstrap.jpg"
      },
      {
        "name":"MongoDB",
        "description":"I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image":"mongo.jpg"
      },
      {
        "name":"Heroku",
        "description":"I use Heroku as my hosting platform for most of my projects because so far they are all unpaid and their free tier is convenient. I also appreciate its integration with Github for such simple deployment.",
        "image":"heroku.jpg"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Data Visualizatio",
        "category":"Course Project where I developed visualizations on IMDB Movie dataset",
        "image":"visual.png",
        "url":"github.com/MelvinAlex28/Data-Visualization-Individual-Project"
      },
      {
        "title":"Weather Application",
        "category":"Full stack Weather Application using React",
        "image":"weather.png",
        "url":"https://github.com/MelvinAlex28/weatherapplication"
      },
      {
        "title":"SQL Query Evaluator",
        "category":"Designed a Full-Stack Database to perform sql operations",
        "image":"sql.png",
        "url":"https://github.com/MelvinAlex28/CIS552Project"
      },
      {
        "title":"Plagiarism Checker",
        "category":"A software to check the plagiarism content present in the file submitted",
        "image":"plagiarism.png",
        "url":"https://github.com/MelvinAlex28/Plagiarism"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"I got the opportunity to work with Melvin and his team during his final year undergrad project. If I have to assign roles to each of the members of his team then without any doubt he is 'The Captain of the Ship'. I have seen him acting like a leader and owning up the work done in most of the situations. He is a very good orator and he clearly knows what he is talking about! His calmness, sincerity, politeness and his positive body language are his strengths.",
        "user":"Priya Kaul - Associate Professor at DBIT"
      }
    ]
  }
}
